
// завдання 1.1
var a = 1;
let b = 2;
const c = 3; // значення цієї змінної перезаписати не можна - буде помилка

a = 10; // ?
b = 20; // ?
c = 30; // ?

сonsole.log(a); // 10
console.log(b); // 20
console.log(c); // 3 - помилка, бо константа не може бути змінена
____________________________________________________________________________________________________________________________

// завдання 1.2
const user = { name: "Pasha" };
user.name = "Gleb";
user.age = 34;
console.log(user); // ми не можемо перезаписати константу user, але ми можемо змінювати її властивості. В результаті отримаємо { name: "Gleb", age: 34 }
_____________________________________________________________________________________________________________________________

// завдання 1.3
const //  використовуємо на постійній основі, коли нам потрібно зберегти значення, яке не повинно змінюватися. 
let // використовуємо, коли нам потрібно зберегти значення, яке может изменяться в процессе выполнения программы.
var // не використорвуємо, так як це застарілий спосіб оголошення змінних, який має проблеми з областю видимості та може призвести до помилок у коді.
______________________________________________________________________________________________________________________________

// завдання 2.1
let userAge = 25;
let userName = "Pasha";
let isActive = true;
let userNames = ["Anna", "Oleh"];
_______________________________________________________________________________________________________________________________

// завдання 2.2

let userName — звичайна змінна // все вірно
let is_logged_in — булеве значення // не вірно, замінити на let isLoggedIn
const maxRetryCount — константа // все вірно
function GetData() — функція // не вірно, замінити на function getData

_______________________________________________________________________________________________________________________________

// завдання 3.1
if (true) {
  var x = 10;
  let y = 20;
}

console.log(x); // var має функціональну область видимості (function scope), а не блокову. Тому змінна x буде доступна поза межами блоку if і виведе 10.
console.log(y); // let має блокову область видимості, тому змінна y буде недоступна поза межами блоку if.
________________________________________________________________________________________________________________________________


// завдання 3.2
function test() {
  let local = "я всередині функції";
  console.log(local); // виведе - "я всередині функції", тому що змінна local доступна в межах функції test.
}

test();
console.log(local); // ? а тут буде помилка, тому що змінна local не доступна поза межами функції test.
_________________________________________________________________________________________________________________________________


// завдання 3.3
// грубо кажучі, var по ієрархії дивиться ширше ніж let і const. var має функціональну область видимості, тому вона доступна в межах всієї функції, в якій вона оголошена, а також поза нею. let і const мають блокову область видимості, тому вони доступні лише в межах блоку, в якому вони оголошені (наприклад, всередині if, for, while тощо). Це означає, що var може бути доступним у більш широкому контексті, ніж let і const.

__________________________________________________________________________________________________________________________________

// завдання 4.1

console.log(first);  
var first = "var-змінна"; //// виведе undefined, тому що змінна first оголошена за допомогою var, і вона піднімається (hoisted) вгору свого контексту. Однак, її значення ще не присвоєно на момент виклику console.log, тому вона має значення undefined.

console.log(second); 
let second = "let-змінна"; //// виведе помилку ReferenceError, тому що змінна second оголошена за допомогою let, тому виклик console.log(second) до оголошення змінної second призведе до помилки.
__________________________________________________________________________________________________________________________________

// завдання 4.2
//Один рядок виведе значення - це буде hoisting із undefined (var), інший — кине помилку - це буде Temporal Dead Zone
___________________________________________________________________________________________________________________________________

// завдання 4.3

sayHi();        // це працює, тому що функція sayHi оголошена за допомогою function declaration, 
                // яка піднімається (hoisted) вгору свого контексту. Тому виклик sayHi() до оголошення функції працює без проблем.
function sayHi() {
  console.log("Привіт!");
}

sayBye();       // тут беде помилка, тому що sayBye оголошена за допомогою function expression, яка не піднімається (hoisted) вгору свого контексту. спочатку виконується код, і коли досягає виклику sayBye(), змінна sayBye ще не визначена, тому виникає помилка ReferenceError.
const sayBye = function () {
  console.log("Бувай!");
};